devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
                        err = sys_mutex_create(KMTX_TYPE_NORMAL, &hdl->mutex);
                        if (!err) {

                                /*
                                 * Each DMA description is aligned to DMA cache line.
                                 */
                                hdl->DMA_rx_desc = (void*)DMA_ALIGN_DOWN((u32_t)hdl->descs_and_buffs + CPU_CACHE_ALIGN - 1);
                                hdl->DMA_tx_desc = (void*)DMA_ALIGN_DOWN((u32_t)hdl->descs_and_buffs + RX_DESC_ARRAY_SIZE + CPU_CACHE_ALIGN - 1);

                                /*
                                 * Each RX/TX buffer (even for single packet) is aligned to
                                 * DMA cache line.
                                 */
                                hdl->rx_buff = (void*)DMA_ALIGN_DOWN((u32_t)hdl->DMA_tx_desc + TX_DESC_ARRAY_SIZE + CPU_CACHE_ALIGN - 1);
                                hdl->tx_buff = (void*)DMA_ALIGN_DOWN((u32_t)hdl->rx_buff + RX_BUF_ARRAY_SIZE + CPU_CACHE_ALIGN - 1);

                                #if DEBUG
                                printk("padding             : %u", (u32_t)hdl->DMA_rx_desc - (u32_t)hdl->descs_and_buffs);
                                printk("hdl->descs_and_buffs: %p %u", hdl->descs_and_buffs, sizeof(hdl->descs_and_buffs));
                                printk("hdl->DMA_rx_desc    : %p %u", hdl->DMA_rx_desc, RX_DESC_ARRAY_SIZE);
                                printk("hdl->DMA_tx_desc    : %p %u", hdl->DMA_tx_desc, TX_DESC_ARRAY_SIZE);
                                printk("hdl->rx_buff        : %p %u", hdl->rx_buff, RX_BUF_ARRAY_SIZE);
                                printk("hdl->tx_buff        : %p %u", hdl->tx_buff, TX_BUF_ARRAY_SIZE);
                                #endif

                                if (config) {
                                        hdl->config = *cast(ETH_config_t*,config);
                                        eth->configured = true;
                                }
                        }
                }

                if (!err) {
                        eth = hdl;

                } else {
                        if (hdl->rx_semaphore) {
                                sys_semaphore_destroy(hdl->rx_semaphore);
                        }

                        if (hdl->mutex) {
                                sys_mutex_destroy(hdl->mutex);
                        }

                        sys_free(device_handle);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(ETH, void *device_handle)
{
        struct eth *hdl = device_handle;

        int err;

        if (not hdl->run) {
                kmtx_t *mtx = hdl->mutex;

                err = sys_mutex_lock(mtx, _MAX_DELAY_MS);
                if (!err) {

                        hdl->mutex = NULL;
                        sys_sleep_ms(MUTEX_TIMEOUT + MUTEX_TIMEOUT/2);

                        HAL_ETH_DeInit(&hdl->eth);
                        NVIC_DisableIRQ(ETH_IRQn);

                        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN
                                              | RCC_AHBxENR_ETHMACTXEN
                                              | RCC_AHBxENR_ETHMACEN);

                        sys_mutex_destroy(mtx);
                        sys_semaphore_destroy(hdl->rx_semaphore);
                        sys_free(&device_handle);
                        eth = NULL;
                }
        } else {
                err = EBUSY;
        }

        return err;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(ETH, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(ETH, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrctr                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(ETH,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrctr,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG2(fpos, fattr);

        struct eth *hdl = device_handle;

        int err  = EPERM;
        size_t n = 0;

        while (count > 0) {
                size_t len = min(count, ETH_MAX_PACKET_SIZE);

                ETH_packet_t pkt;
                pkt.payload = const_cast(src);
                pkt.length  = len;
                err = packet_send(hdl, &pkt);
                if (!err) {
                        src   += len;
                        count -= len;
                        n     += len;
                } else {
                        break;
                }
        }

        *wrctr = n;

