devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
        return err;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdctr                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(ETH,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdctr,
             struct vfs_fattr fattr)
{
        UNUSED_ARG2(fpos, fattr);

        struct eth *hdl = device_handle;

        ETH_packet_t pkt;
        pkt.payload = dst;
        pkt.length  = min(count, ETH_MAX_PACKET_SIZE);
        int err = packet_receive(hdl, &pkt);
        if (!err) {
                *rdctr = pkt.length;
        }

        return err;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(ETH, void *device_handle, int request, void *arg)
{
        struct eth *hdl = device_handle;

        int err = EINVAL;

        switch (request) {
        case IOCTL_ETH__CONFIGURE:
                if (arg) {
                        hdl->config = *cast(ETH_config_t*, arg);
                        eth->configured = true;
                        err = 0;
                }
                break;

        case IOCTL_ETH__SEND_PACKET:
                if (arg) {
                        err = packet_send(hdl, arg);
                }
                break;

        case IOCTL_ETH__RECEIVE_PACKET:
                if (arg) {
                        err = packet_receive(hdl, arg);
                }
                break;

        case IOCTL_ETH__SET_RX_TIMEOUT:
                if (arg) {
                        hdl->rx_timeout_ms = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_ETH__SET_TX_TIMEOUT:
                if (arg) {
                        hdl->tx_timeout_ms = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_ETH__START:
                err = eth_start(hdl);
                break;

        case IOCTL_ETH__STOP:
                err = eth_stop(hdl);
                break;

        case IOCTL_ETH__GET_STATUS:
                if (arg) {
                        err = eth_get_info(hdl, arg);
                }
                break;

        default:
                return EBADRQC;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(ETH, void *device_handle)
{
        struct eth *hdl = device_handle;
        int err = eth_flush(hdl);
        return err;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(ETH, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Start Ethernet interface.
 *
 * @param  hdl          device handle
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_start(struct eth *hdl)
{
        int err = sys_mutex_lock(hdl->mutex, MAX_DELAY_MS);
        if (!err) {
                if (not hdl->run and hdl->configured) {

                        const ETH_config_t *conf = &hdl->config;

                        HAL_ETH_DeInit(&hdl->eth);

                        memcpy(hdl->MAC_addr, conf->MAC, sizeof(hdl->MAC_addr));

                        hdl->eth.Instance = ETH;
                        hdl->eth.Init.MACAddr = hdl->MAC_addr;
                        hdl->eth.Init.RxDesc = hdl->DMA_rx_desc;
                        hdl->eth.Init.TxDesc = hdl->DMA_tx_desc;
                        hdl->eth.Init.RxBuffLen = ETH_RX_BUFFER_SIZE;
                        HAL_ETH_DescAssignMemory()
                        while (true) {
                                err = HAL_ETH_Init(&hdl->eth);
                                if (!err) {
                                        memset(&hdl->tx_config, 0, sizeof(hdl->tx_config));
                                        hdl->tx_config.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
                                        hdl->tx_config.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
                                        hdl->tx_config.CRCPadCtrl = ETH_CRC_PAD_INSERT;



                                        // TODO PHY configuration

                        // TODO other settings
//                        hdl->eth.Init.AutoNegotiation = conf->auto_negotiation ? ETH_AUTONEGOTIATION_ENABLE : ETH_AUTONEGOTIATION_DISABLE;
//                        hdl->eth.Init.Speed = (conf->speed == ETH_SPEED__100Mbps) ? ETH_SPEED_100M : ETH_SPEED_10M;
//                        hdl->eth.Init.DuplexMode = (conf->duplex == ETH_DUPLEX__FULL) ? ETH_MODE_FULLDUPLEX : ETH_MODE_HALFDUPLEX;
//                        hdl->eth.Init.RxMode = ETH_RXINTERRUPT_MODE;
//                        hdl->eth.Init.ChecksumMode = __ETH_CHECKSUM_BY_HARDWARE__;
//                        hdl->eth.Init.PhyAddress = __ETH_PHY_ADDRESS__;

                                        ETH_MACConfigTypeDef MACConf;
                                        HAL_ETH_GetMACConfig(&hdl->eth, &MACConf);
                                        MACConf.DuplexMode = duplex;
                                        MACConf.Speed = speed;
                                        HAL_ETH_SetMACConfig(&hdl->eth, &MACConf);
                                        err = HAL_ETH_Start_IT(&hdl->eth);
                                        if (!err) {
                                                hdl->run = true;
                                        }

                                } else if (err and conf->auto_negotiation) {
                                        printk("ETH: disabling auto-negotiation");
//                                        hdl->eth.Init.AutoNegotiation = ETH_AUTONEGOTIATION_DISABLE;
                                        continue;
                                }

                                break;
                        }

