devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
                        printk("ETH: start %s (%d)", err ? "fail" : "success", err);

                } else {
                        err = EPERM;
                }

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Stop Ethernet interface.
 *
 * @param  hdl          device handle
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_stop(struct eth *hdl)
{
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {
                if (hdl->run) {
                        err = HAL_ETH_Stop(&hdl->eth);
                        if (!err) {
                                hdl->run = false;
                        }
                } else {
                        err = EPERM;
                }

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Get Ethernet interface info data.
 *
 * @param  hdl          device handle
 * @param  status       status data
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_get_info(struct eth *hdl, ETH_status_t *status)
{
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {

                if (hdl->run) {
                        u32_t reg;

                        if (HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_BSR, &reg) == HAL_OK) {

                                if (reg & PHY_BSR_LINK_STATUS) {
                                        status->link_status = ETH_LINK_STATUS__CONNECTED;
                                } else {
                                        status->link_status = ETH_LINK_STATUS__DISCONNECTED;
                                }
                        } else {
                                status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                        }

                        if (HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, __ETH_PHY_SR__, &reg) == HAL_OK) {

                                if (reg & __ETH_PHY_SPEED_STATUS_BM__) {
                                        status->speed = ETH_SPEED__10Mbps;
                                } else {
                                        status->speed = ETH_SPEED__100Mbps;
                                }

                                if (reg & __ETH_PHY_DUPLEX_STATUS_BM__) {
                                        status->duplex = ETH_DUPLEX__FULL;
                                } else {
                                        status->duplex = ETH_DUPLEX__HALF;
                                }
                        } else {
                                status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                        }
                } else {
                        status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                }

                memcpy(status->MAC, hdl->MAC_addr, sizeof(status->MAC));

                status->configured = hdl->configured;
                status->rx_bytes   = hdl->stats.rx_bytes;
                status->tx_bytes   = hdl->stats.tx_bytes;
                status->rx_packets = hdl->stats.rx_packets;
                status->tx_packets = hdl->stats.tx_packets;

                switch (HAL_ETH_GetState(&hdl->eth)) {
                case HAL_ETH_STATE_RESET:
                        status->state = ETH_STATE__RESET;
                        break;
                case HAL_ETH_STATE_READY:
                case HAL_ETH_STATE_BUSY:
                        status->state = ETH_STATE__READY;
                        break;
                case HAL_ETH_STATE_ERROR:
                        status->state = ETH_STATE__ERROR;
                        break;
                }

                update_dropped_rx_frames(hdl);
                status->rx_dropped_frames = hdl->stats.rx_dropped_frames;

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Flush Ethernet interface Tx buffers.
 *
 * @param  hdl          device handle
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_flush(struct eth *hdl)
{
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {
                int empty_bufs;
                do {
                        empty_bufs = 0;

                        for (int i = 0; i < __ETH_TXBUFNB__; i++) {
                                if (not (hdl->DMA_tx_desc[i].Status & ETH_DMATXDESC_OWN)) {
                                        empty_bufs++;
                                }
                        }

                        sys_sleep_ms(10);

                } while (empty_bufs < __ETH_TXBUFNB__);

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Send packet.
 *
 * @param  hdl          device handle
 * @param  pkt          packet
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int packet_send(struct eth *hdl, const ETH_packet_t *pkt)
{
        int err = hdl->run ? ESUCC : EPERM;

        clock_t tref = sys_get_uptime_ms();

        hdl->tx_config.Length = pkt->length;
        hdl->tx_config.TxBuffer = pkt->payload;

        while (true) {
                err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
                if (!err) {
                        ETH_DMADescTypeDef *dmatxdesc = (ETH_DMADescTypeDef *)(&hdl->eth.TxDescList)->TxDesc[hdl->eth.TxDescList.CurTxDesc];
                        _cpuctl_invalidate_dcache_by_addr((uint32_t*)dmatxdesc, sizeof(*dmatxdesc));

